// 1. Створіть змінну з ім'ям `name` і присвойте їй ваше ім'я. Виведіть це ім'я в
//    консоль.

// const username = 'Volodka';
// console.log(username);

// 2. Створіть змінну `age` і присвойте їй ваш вік. Виведіть в консоль рядок, що
//    містить ваш вік у такому форматі: "Мені {вік} років".

// const age = 22;
// const message = `Мені ${age} років!`;
// console.log(message);

// 3. Створіть змінні `x` і `y` і присвойте їм довільні числа. Виведіть в консоль
//    результати додавання, віднімання, множення та ділення цих чисел.

// const x = 5;
// const y = 10;

// console.log(x + y);
// console.log(x - y);
// console.log(x * y);
// console.log(x / y);
// console.log(x % y);
// console.log(x ** y);

// 4. Створіть змінну `city` і присвойте їй назву вашого міста. Створіть рядок,
//    який містить "Я живу в місті {назва міста}", і виведіть його в консоль.

// const city = prompt('Enter your city:');
// console.log(`Я живу в місті ${city}`);

// 5. Створіть рядок з вашою електронною поштою. Використайте методи рядка, щоб
//    витягнути ваше ім'я та доменну частину. Виведіть обидва ці значення в
//    консоль.

// 6. Створіть змінну `price` і присвойте їй число. Створіть рядок, що містить ціну
//    з символом гривні, наприклад: "Ціна: 500 грн".

// const price = 500;
// const message = `Ціна: ${price} грн`;
// console.log(message);

// 7. Створіть змінну `isLogged`, яка має булеве значення. Виведіть в консоль
//    повідомлення "Користувач авторизований", якщо `isLogged` дорівнює `true`, і
//    "Користувач неавторизований", якщо `isLogged` дорівнює `false`.
